[Turkish]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Eşleştirme için lütfen aygıtın 2.4GHz USB donanım anahtarını bilgisayarınızın USB bağlantı noktasına bağlayın.
Please follow the steps below for pairing. = Lütfen eşleştirme için aşağıdaki adımları izleyin.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Bağlantı anahtarını RF 2.4GHz moduna ayarlayın.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Sol düğmeyi, sağ düğmeyi ve DPI düğmesini 3 saniye basılı tutun.
3. Click the "Pair" button on the interface. = 3. Arayüzdeki “Eşleştir” düğmesine tıklayın.	
1. Connect the device to your computer with the USB cable. = 1. Aygıtı USB kablosuyla bilgisayarınıza bağlayın.
2. Click the "Pair" button on the interface. = 2. Arayüzdeki “Eşleştir” düğmesine tıklayın.

Pair = Eşleştir
Close = Kapat
Pairing = Eşleştirme
Pairing completed = Eşleştirme tamamlandı
Pairing failed = Eşleştirme başarısız

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Cihazı bir USB kablosuyla bilgisayara bağlayın ve bağlantı anahtarını 2,4 GHz RF moduna ayarlayın.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Sesli istemleri duyana kadar işlev düğmesini 15 saniye basılı tutun.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = 2,4 GHz RF alıcısını çıkarın ve yeniden takın. Aygıtı kapatın ve sonra aygıtı 2,4 GHz RF moduna geçirin.